# Usft Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Usft Property
SymbolTypeId Class See Also
---
Symbol USft, indicating unit US survey feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Usft { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Usft As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Usft {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace